[Killed] BlockStatement
app/lib/discount.ts:18:11
   discValue: string,
   discMode: DiscountMode,
   cap: number | undefined | null,
-): number {
-  const safeCap = typeof cap === "number" && Number.isFinite(cap) ? Math.max(0, Math.floor(cap)) : 0;
-  if (safeCap <= 0) return 0;
-  if (discMode === "PCT") {
-    // A leading "-" is not a formatting artifact — it is invalid discount
-    // input. The sanitizer below strips non-numeric chars, which would turn
-    // "-10" into "10" (a positive discount). Reject negatives explicitly.
-    if (/-/.test(discValue)) return 0;
-    const pct = Number(discValue.replace(/[^0-9.]/g, ""));
-    const safePct = Number.isFinite(pct) ? Math.max(0, Math.min(100, pct)) : 0;
-    if (safePct <= 0) return 0;
-    return Math.max(0, Math.min(safeCap, Math.round((safeCap * safePct) / 100)));
-  }
-  const fixed = parseToCents(discValue || "0");
-  if (!Number.isFinite(fixed)) return 0;
-  return Math.max(0, Math.min(safeCap, fixed));
-}
+): number {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 13 failed) 47ms

   ❯ computeDiscountCents — cap robustness (5)
     × undefined cap → 0 19ms

[Killed] EqualityOperator
app/lib/discount.ts:19:19
   discMode: DiscountMode,
   cap: number | undefined | null,
 ): number {
-  const safeCap = typeof cap === "number" && Number.isFinite(cap) ? Math.max(0, Math.floor(cap)) : 0;
+  const safeCap = typeof cap !== "number" && Number.isFinite(cap) ? Math.max(0, Math.floor(cap)) : 0;
   if (safeCap <= 0) return 0;
   if (discMode === "PCT") {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 5 failed) 81ms

   ❯ computeDiscountCents — PCT mode (5)
     × 10% of ₱100.00 → ₱10.00 33ms

[Killed] ConditionalExpression
app/lib/discount.ts:19:19
   discMode: DiscountMode,
   cap: number | undefined | null,
 ): number {
-  const safeCap = typeof cap === "number" && Number.isFinite(cap) ? Math.max(0, Math.floor(cap)) : 0;
+  const safeCap = true ? Math.max(0, Math.floor(cap)) : 0;
   if (safeCap <= 0) return 0;
   if (discMode === "PCT") {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 3 failed) 86ms

   ❯ computeDiscountCents — cap robustness (5)

[Killed] EqualityOperator
app/lib/discount.ts:20:7
   cap: number | undefined | null,
 ): number {
   const safeCap = typeof cap === "number" && Number.isFinite(cap) ? Math.max(0, Math.floor(cap)) : 0;
-  if (safeCap <= 0) return 0;
+  if (safeCap > 0) return 0;
   if (discMode === "PCT") {
     // A leading "-" is not a formatting artifact — it is invalid discount
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 5 failed) 86ms

   ❯ computeDiscountCents — PCT mode (5)

[Killed] ConditionalExpression
app/lib/discount.ts:20:7
   cap: number | undefined | null,
 ): number {
   const safeCap = typeof cap === "number" && Number.isFinite(cap) ? Math.max(0, Math.floor(cap)) : 0;
-  if (safeCap <= 0) return 0;
+  if (true) return 0;
   if (discMode === "PCT") {
     // A leading "-" is not a formatting artifact — it is invalid discount
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 5 failed) 85ms

   ❯ computeDiscountCents — PCT mode (5)

[Killed] BlockStatement
app/lib/discount.ts:21:27
 ): number {
   const safeCap = typeof cap === "number" && Number.isFinite(cap) ? Math.max(0, Math.floor(cap)) : 0;
   if (safeCap <= 0) return 0;
-  if (discMode === "PCT") {
-    // A leading "-" is not a formatting artifact — it is invalid discount
-    // input. The sanitizer below strips non-numeric chars, which would turn
-    // "-10" into "10" (a positive discount). Reject negatives explicitly.
-    if (/-/.test(discValue)) return 0;
-    const pct = Number(discValue.replace(/[^0-9.]/g, ""));
-    const safePct = Number.isFinite(pct) ? Math.max(0, Math.min(100, pct)) : 0;
-    if (safePct <= 0) return 0;
-    return Math.max(0, Math.min(safeCap, Math.round((safeCap * safePct) / 100)));
-  }
+  if (discMode === "PCT") {}
   const fixed = parseToCents(discValue || "0");
   if (!Number.isFinite(fixed)) return 0;
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 1 failed) 109ms

   ❯ computeDiscountCents — PCT mode (5)

[Killed] ConditionalExpression
app/lib/discount.ts:21:7
 ): number {
   const safeCap = typeof cap === "number" && Number.isFinite(cap) ? Math.max(0, Math.floor(cap)) : 0;
   if (safeCap <= 0) return 0;
-  if (discMode === "PCT") {
+  if (false) {
     // A leading "-" is not a formatting artifact — it is invalid discount
     // input. The sanitizer below strips non-numeric chars, which would turn
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 1 failed) 63ms

   ❯ computeDiscountCents — PCT mode (5)

[Killed] ConditionalExpression
app/lib/discount.ts:25:9
     // A leading "-" is not a formatting artifact — it is invalid discount
     // input. The sanitizer below strips non-numeric chars, which would turn
     // "-10" into "10" (a positive discount). Reject negatives explicitly.
-    if (/-/.test(discValue)) return 0;
+    if (true) return 0;
     const pct = Number(discValue.replace(/[^0-9.]/g, ""));
     const safePct = Number.isFinite(pct) ? Math.max(0, Math.min(100, pct)) : 0;
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 3 failed) 68ms

   ❯ computeDiscountCents — PCT mode (5)

[Killed] ConditionalExpression
app/lib/discount.ts:25:9
     // A leading "-" is not a formatting artifact — it is invalid discount
     // input. The sanitizer below strips non-numeric chars, which would turn
     // "-10" into "10" (a positive discount). Reject negatives explicitly.
-    if (/-/.test(discValue)) return 0;
+    if (false) return 0;
     const pct = Number(discValue.replace(/[^0-9.]/g, ""));
     const safePct = Number.isFinite(pct) ? Math.max(0, Math.min(100, pct)) : 0;
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 1 failed) 86ms

   ❯ computeDiscountCents — PCT mode (5)

[Killed] MethodExpression
app/lib/discount.ts:27:56
     // "-10" into "10" (a positive discount). Reject negatives explicitly.
     if (/-/.test(discValue)) return 0;
     const pct = Number(discValue.replace(/[^0-9.]/g, ""));
-    const safePct = Number.isFinite(pct) ? Math.max(0, Math.min(100, pct)) : 0;
+    const safePct = Number.isFinite(pct) ? Math.max(0, Math.max(100, pct)) : 0;
     if (safePct <= 0) return 0;
     return Math.max(0, Math.min(safeCap, Math.round((safeCap * safePct) / 100)));
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 3 failed) 35ms

   ❯ computeDiscountCents — PCT mode (5)

[Killed] MethodExpression
app/lib/discount.ts:27:44
     // "-10" into "10" (a positive discount). Reject negatives explicitly.
     if (/-/.test(discValue)) return 0;
     const pct = Number(discValue.replace(/[^0-9.]/g, ""));
-    const safePct = Number.isFinite(pct) ? Math.max(0, Math.min(100, pct)) : 0;
+    const safePct = Number.isFinite(pct) ? Math.min(0, Math.min(100, pct)) : 0;
     if (safePct <= 0) return 0;
     return Math.max(0, Math.min(safeCap, Math.round((safeCap * safePct) / 100)));
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 3 failed) 62ms

   ❯ computeDiscountCents — PCT mode (5)

[Killed] EqualityOperator
app/lib/discount.ts:28:9
     if (/-/.test(discValue)) return 0;
     const pct = Number(discValue.replace(/[^0-9.]/g, ""));
     const safePct = Number.isFinite(pct) ? Math.max(0, Math.min(100, pct)) : 0;
-    if (safePct <= 0) return 0;
+    if (safePct > 0) return 0;
     return Math.max(0, Math.min(safeCap, Math.round((safeCap * safePct) / 100)));
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 3 failed) 103ms
   ❯ computeDiscountCents — PCT mode (5)
     × 10% of ₱100.00 → ₱10.00 37ms
     × clamps above 100% 4ms

[Killed] ConditionalExpression
app/lib/discount.ts:28:9
     if (/-/.test(discValue)) return 0;
     const pct = Number(discValue.replace(/[^0-9.]/g, ""));
     const safePct = Number.isFinite(pct) ? Math.max(0, Math.min(100, pct)) : 0;
-    if (safePct <= 0) return 0;
+    if (true) return 0;
     return Math.max(0, Math.min(safeCap, Math.round((safeCap * safePct) / 100)));
   }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 3 failed) 61ms

   ❯ computeDiscountCents — PCT mode (5)

[Killed] MethodExpression
app/lib/discount.ts:29:24
     const pct = Number(discValue.replace(/[^0-9.]/g, ""));
     const safePct = Number.isFinite(pct) ? Math.max(0, Math.min(100, pct)) : 0;
     if (safePct <= 0) return 0;
-    return Math.max(0, Math.min(safeCap, Math.round((safeCap * safePct) / 100)));
+    return Math.max(0, Math.max(safeCap, Math.round(safeCap * safePct / 100)));
   }
   const fixed = parseToCents(discValue || "0");
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 2 failed) 45ms

   ❯ computeDiscountCents — PCT mode (5)

[Killed] MethodExpression
app/lib/discount.ts:29:12
     const pct = Number(discValue.replace(/[^0-9.]/g, ""));
     const safePct = Number.isFinite(pct) ? Math.max(0, Math.min(100, pct)) : 0;
     if (safePct <= 0) return 0;
-    return Math.max(0, Math.min(safeCap, Math.round((safeCap * safePct) / 100)));
+    return Math.min(0, Math.min(safeCap, Math.round(safeCap * safePct / 100)));
   }
   const fixed = parseToCents(discValue || "0");
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 3 failed) 208ms

   ❯ computeDiscountCents — PCT mode (5)

[Killed] LogicalOperator
app/lib/discount.ts:31:30
     if (safePct <= 0) return 0;
     return Math.max(0, Math.min(safeCap, Math.round((safeCap * safePct) / 100)));
   }
-  const fixed = parseToCents(discValue || "0");
+  const fixed = parseToCents(discValue && "0");
   if (!Number.isFinite(fixed)) return 0;
   return Math.max(0, Math.min(safeCap, fixed));
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 2 failed) 130ms

   ❯ computeDiscountCents — FIX mode (3)

[Killed] ConditionalExpression
app/lib/discount.ts:31:30
     if (safePct <= 0) return 0;
     return Math.max(0, Math.min(safeCap, Math.round((safeCap * safePct) / 100)));
   }
-  const fixed = parseToCents(discValue || "0");
+  const fixed = parseToCents(false);
   if (!Number.isFinite(fixed)) return 0;
   return Math.max(0, Math.min(safeCap, fixed));
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo


 ❯ tests/unit/discount.test.ts (13 tests | 3 failed) 34ms

   ❯ computeDiscountCents — FIX mode (3)

     × happy path ₱5.00 off ₱100.00 10ms

[Killed] ConditionalExpression
app/lib/discount.ts:32:7
     return Math.max(0, Math.min(safeCap, Math.round((safeCap * safePct) / 100)));
   }
   const fixed = parseToCents(discValue || "0");
-  if (!Number.isFinite(fixed)) return 0;
+  if (true) return 0;
   return Math.max(0, Math.min(safeCap, fixed));
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 2 failed) 46ms

   ❯ computeDiscountCents — FIX mode (3)

[Killed] BooleanLiteral
app/lib/discount.ts:32:7
     return Math.max(0, Math.min(safeCap, Math.round((safeCap * safePct) / 100)));
   }
   const fixed = parseToCents(discValue || "0");
-  if (!Number.isFinite(fixed)) return 0;
+  if (Number.isFinite(fixed)) return 0;
   return Math.max(0, Math.min(safeCap, fixed));
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 2 failed) 69ms

   ❯ computeDiscountCents — FIX mode (3)

[Killed] MethodExpression
app/lib/discount.ts:33:10
   }
   const fixed = parseToCents(discValue || "0");
   if (!Number.isFinite(fixed)) return 0;
-  return Math.max(0, Math.min(safeCap, fixed));
+  return Math.min(0, Math.min(safeCap, fixed));
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 2 failed) 34ms

   ❯ computeDiscountCents — FIX mode (3)

[Killed] MethodExpression
app/lib/discount.ts:33:22
   }
   const fixed = parseToCents(discValue || "0");
   if (!Number.isFinite(fixed)) return 0;
-  return Math.max(0, Math.min(safeCap, fixed));
+  return Math.max(0, Math.max(safeCap, fixed));
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/discount.test.ts (13 tests | 3 failed) 32ms

   ❯ computeDiscountCents — FIX mode (3)
