[Killed] BlockStatement
app/lib/posRules.ts:15:76
 // Bills: ₱1000/500/200/100/50/20 · Coins: ₱20/10/5/1 · Centavos: 25/10/5/1.
 export const DENOMINATIONS_CENTS = [100000, 50000, 20000, 10000, 5000, 2000, 1000, 500, 100, 25, 10, 5, 1] as const;
 
-export function floatCents(counts: CashCount[] | null | undefined): number {
-  if (!counts) return 0;
-  return counts.reduce((s, c) => {
-    const d = Math.floor(c.denomination);
-    const n = Math.floor(c.count);
-    return d > 0 && n > 0 ? s + d * n : s;
-  }, 0);
-}
+export function floatCents(counts: CashCount[] | null | undefined): number {}
 
 export function toCounts(values: Record<number, number>): CashCount[] {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 2 failed) 57ms

   × floatCents sums denomination × count 18ms

[Killed] BooleanLiteral
app/lib/posRules.ts:16:7
 export const DENOMINATIONS_CENTS = [100000, 50000, 20000, 10000, 5000, 2000, 1000, 500, 100, 25, 10, 5, 1] as const;
 
 export function floatCents(counts: CashCount[] | null | undefined): number {
-  if (!counts) return 0;
+  if (counts) return 0;
   return counts.reduce((s, c) => {
     const d = Math.floor(c.denomination);
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 2 failed) 67ms

   × floatCents sums denomination × count 33ms

[Killed] ConditionalExpression
app/lib/posRules.ts:16:7
 export const DENOMINATIONS_CENTS = [100000, 50000, 20000, 10000, 5000, 2000, 1000, 500, 100, 25, 10, 5, 1] as const;
 
 export function floatCents(counts: CashCount[] | null | undefined): number {
-  if (!counts) return 0;
+  if (true) return 0;
   return counts.reduce((s, c) => {
     const d = Math.floor(c.denomination);
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 2 failed) 59ms

   × floatCents sums denomination × count 36ms

[Killed] BlockStatement
app/lib/posRules.ts:17:34
 
 export function floatCents(counts: CashCount[] | null | undefined): number {
   if (!counts) return 0;
-  return counts.reduce((s, c) => {
-    const d = Math.floor(c.denomination);
-    const n = Math.floor(c.count);
-    return d > 0 && n > 0 ? s + d * n : s;
-  }, 0);
+  return counts.reduce((s, c) => {}, 0);
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 2 failed) 40ms

   × floatCents sums denomination × count 24ms

[Killed] ConditionalExpression
app/lib/posRules.ts:20:12
   return counts.reduce((s, c) => {
     const d = Math.floor(c.denomination);
     const n = Math.floor(c.count);
-    return d > 0 && n > 0 ? s + d * n : s;
+    return true ? s + d * n : s;
   }, 0);
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 83ms

   × floatCents ignores junk rows (zero/negative/non-integer) 42ms

[Killed] ConditionalExpression
app/lib/posRules.ts:20:12
   return counts.reduce((s, c) => {
     const d = Math.floor(c.denomination);
     const n = Math.floor(c.count);
-    return d > 0 && n > 0 ? s + d * n : s;
+    return true && n > 0 ? s + d * n : s;
   }, 0);
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 110ms

   × floatCents ignores junk rows (zero/negative/non-integer) 69ms

[Killed] BlockStatement
app/lib/posRules.ts:24:71
   }, 0);
 }
 
-export function toCounts(values: Record<number, number>): CashCount[] {
-  return Object.entries(values)
-    .map(([denom, count]) => ({ denomination: Number(denom), count: Math.max(0, Math.floor(count || 0)) }))
-    .filter((c) => c.count > 0)
-    .sort((a, b) => b.denomination - a.denomination);
-}
+export function toCounts(values: Record<number, number>): CashCount[] {}
 
 // Discount is over-threshold when % of total OR absolute cents exceed their caps.
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 37ms

   × toCounts floors, drops zero counts, sorts desc 16ms

[Killed] MethodExpression
app/lib/posRules.ts:25:10
 }
 
 export function toCounts(values: Record<number, number>): CashCount[] {
-  return Object.entries(values)
-    .map(([denom, count]) => ({ denomination: Number(denom), count: Math.max(0, Math.floor(count || 0)) }))
-    .filter((c) => c.count > 0)
+  return Object.entries(values).map(([denom, count]) => ({
+  denomination: Number(denom),
+  count: Math.max(0, Math.floor(count || 0))
+}))
     .sort((a, b) => b.denomination - a.denomination);
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 49ms

   × toCounts floors, drops zero counts, sorts desc 22ms

[Killed] MethodExpression
app/lib/posRules.ts:25:10
 }
 
 export function toCounts(values: Record<number, number>): CashCount[] {
-  return Object.entries(values)
-    .map(([denom, count]) => ({ denomination: Number(denom), count: Math.max(0, Math.floor(count || 0)) }))
-    .filter((c) => c.count > 0)
-    .sort((a, b) => b.denomination - a.denomination);
+  return Object.entries(values).map(([denom, count]) => ({
+  denomination: Number(denom),
+  count: Math.max(0, Math.floor(count || 0))
+})).filter(c => c.count > 0);
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 60ms
   × toCounts floors, drops zero counts, sorts desc 29ms

[Killed] MethodExpression
app/lib/posRules.ts:26:69
 
 export function toCounts(values: Record<number, number>): CashCount[] {
   return Object.entries(values)
-    .map(([denom, count]) => ({ denomination: Number(denom), count: Math.max(0, Math.floor(count || 0)) }))
+    .map(([denom, count]) => ({ denomination: Number(denom), count: Math.min(0, Math.floor(count || 0)) }))
     .filter((c) => c.count > 0)
     .sort((a, b) => b.denomination - a.denomination);
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 55ms

   × toCounts floors, drops zero counts, sorts desc 32ms

[Killed] ConditionalExpression
app/lib/posRules.ts:26:92
 
 export function toCounts(values: Record<number, number>): CashCount[] {
   return Object.entries(values)
-    .map(([denom, count]) => ({ denomination: Number(denom), count: Math.max(0, Math.floor(count || 0)) }))
+    .map(([denom, count]) => ({ denomination: Number(denom), count: Math.max(0, Math.floor(false)) }))
     .filter((c) => c.count > 0)
     .sort((a, b) => b.denomination - a.denomination);
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo


 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 44ms

   × toCounts floors, drops zero counts, sorts desc 24ms

[Killed] ConditionalExpression
app/lib/posRules.ts:27:20
 export function toCounts(values: Record<number, number>): CashCount[] {
   return Object.entries(values)
     .map(([denom, count]) => ({ denomination: Number(denom), count: Math.max(0, Math.floor(count || 0)) }))
-    .filter((c) => c.count > 0)
+    .filter((c) => true)
     .sort((a, b) => b.denomination - a.denomination);
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 50ms

   × toCounts floors, drops zero counts, sorts desc 26ms

[Killed] EqualityOperator
app/lib/posRules.ts:27:20
 export function toCounts(values: Record<number, number>): CashCount[] {
   return Object.entries(values)
     .map(([denom, count]) => ({ denomination: Number(denom), count: Math.max(0, Math.floor(count || 0)) }))
-    .filter((c) => c.count > 0)
+    .filter((c) => c.count >= 0)
     .sort((a, b) => b.denomination - a.denomination);
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo


 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 57ms
   × toCounts floors, drops zero counts, sorts desc 31ms


⎯⎯⎯⎯⎯⎯⎯ Failed Tests 1 ⎯⎯⎯⎯⎯⎯⎯

[Killed] ArithmeticOperator
app/lib/posRules.ts:28:21
   return Object.entries(values)
     .map(([denom, count]) => ({ denomination: Number(denom), count: Math.max(0, Math.floor(count || 0)) }))
     .filter((c) => c.count > 0)
-    .sort((a, b) => b.denomination - a.denomination);
+    .sort((a, b) => b.denomination + a.denomination);
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 45ms

   × toCounts floors, drops zero counts, sorts desc 24ms

[Killed] ArrowFunction
app/lib/posRules.ts:28:11
   return Object.entries(values)
     .map(([denom, count]) => ({ denomination: Number(denom), count: Math.max(0, Math.floor(count || 0)) }))
     .filter((c) => c.count > 0)
-    .sort((a, b) => b.denomination - a.denomination);
+    .sort(() => undefined);
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 60ms

   × toCounts floors, drops zero counts, sorts desc 37ms

[Killed] BlockStatement
app/lib/posRules.ts:33:91
 
 // Discount is over-threshold when % of total OR absolute cents exceed their caps.
 // Zero-total carts never carry a valid discount → treated as over-threshold only if cents > 0.
-export function discountOverThreshold(discountCents: number, totalCents: number): boolean {
-  if (discountCents <= 0) return false;
-  if (discountCents > DISCOUNT_MAX_CENTS) return true;
-  if (totalCents <= 0) return false;
-  return (discountCents / totalCents) * 100 > DISCOUNT_MAX_PCT;
-}
+export function discountOverThreshold(discountCents: number, totalCents: number): boolean {}
 
 // Split payment: remaining = total − Σ entered tenders (SRS method-rule "Split math").
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo


 ❯ tests/unit/posRules.test.ts (13 tests | 3 failed) 41ms

   × discount threshold: % boundary — exactly 10% OK, 10%+1 cent over 13ms

   × discount threshold: cents boundary — exactly $500 OK, $500.01 over 3ms

[Killed] ConditionalExpression
app/lib/posRules.ts:34:7
 // Discount is over-threshold when % of total OR absolute cents exceed their caps.
 // Zero-total carts never carry a valid discount → treated as over-threshold only if cents > 0.
 export function discountOverThreshold(discountCents: number, totalCents: number): boolean {
-  if (discountCents <= 0) return false;
+  if (true) return false;
   if (discountCents > DISCOUNT_MAX_CENTS) return true;
   if (totalCents <= 0) return false;
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 3 failed) 73ms

   × discount threshold: % boundary — exactly 10% OK, 10%+1 cent over 34ms

[Killed] BooleanLiteral
app/lib/posRules.ts:34:34
 // Discount is over-threshold when % of total OR absolute cents exceed their caps.
 // Zero-total carts never carry a valid discount → treated as over-threshold only if cents > 0.
 export function discountOverThreshold(discountCents: number, totalCents: number): boolean {
-  if (discountCents <= 0) return false;
+  if (discountCents <= 0) return true;
   if (discountCents > DISCOUNT_MAX_CENTS) return true;
   if (totalCents <= 0) return false;
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 55ms

   × discount threshold edges: 0/none, zero total, 100% discount 20ms

[Killed] EqualityOperator
app/lib/posRules.ts:35:7
 // Zero-total carts never carry a valid discount → treated as over-threshold only if cents > 0.
 export function discountOverThreshold(discountCents: number, totalCents: number): boolean {
   if (discountCents <= 0) return false;
-  if (discountCents > DISCOUNT_MAX_CENTS) return true;
+  if (discountCents <= DISCOUNT_MAX_CENTS) return true;
   if (totalCents <= 0) return false;
   return (discountCents / totalCents) * 100 > DISCOUNT_MAX_PCT;
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 3 failed) 46ms

   × discount threshold: % boundary — exactly 10% OK, 10%+1 cent over 24ms

[Killed] EqualityOperator
app/lib/posRules.ts:35:7
 // Zero-total carts never carry a valid discount → treated as over-threshold only if cents > 0.
 export function discountOverThreshold(discountCents: number, totalCents: number): boolean {
   if (discountCents <= 0) return false;
-  if (discountCents > DISCOUNT_MAX_CENTS) return true;
+  if (discountCents >= DISCOUNT_MAX_CENTS) return true;
   if (totalCents <= 0) return false;
   return (discountCents / totalCents) * 100 > DISCOUNT_MAX_PCT;
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo


 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 42ms

   × discount threshold: cents boundary — exactly $500 OK, $500.01 over 20ms

[Killed] BooleanLiteral
app/lib/posRules.ts:36:31
 export function discountOverThreshold(discountCents: number, totalCents: number): boolean {
   if (discountCents <= 0) return false;
   if (discountCents > DISCOUNT_MAX_CENTS) return true;
-  if (totalCents <= 0) return false;
+  if (totalCents <= 0) return true;
   return (discountCents / totalCents) * 100 > DISCOUNT_MAX_PCT;
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 46ms

   × discount threshold edges: 0/none, zero total, 100% discount 25ms

[Killed] ConditionalExpression
app/lib/posRules.ts:36:7
 export function discountOverThreshold(discountCents: number, totalCents: number): boolean {
   if (discountCents <= 0) return false;
   if (discountCents > DISCOUNT_MAX_CENTS) return true;
-  if (totalCents <= 0) return false;
+  if (true) return false;
   return (discountCents / totalCents) * 100 > DISCOUNT_MAX_PCT;
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 2 failed) 49ms

   × discount threshold: % boundary — exactly 10% OK, 10%+1 cent over 20ms

[Killed] ConditionalExpression
app/lib/posRules.ts:37:10
   if (discountCents <= 0) return false;
   if (discountCents > DISCOUNT_MAX_CENTS) return true;
   if (totalCents <= 0) return false;
-  return (discountCents / totalCents) * 100 > DISCOUNT_MAX_PCT;
+  return true;
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 2 failed) 61ms

   × discount threshold: % boundary — exactly 10% OK, 10%+1 cent over 24ms

[Killed] EqualityOperator
app/lib/posRules.ts:37:10
   if (discountCents <= 0) return false;
   if (discountCents > DISCOUNT_MAX_CENTS) return true;
   if (totalCents <= 0) return false;
-  return (discountCents / totalCents) * 100 > DISCOUNT_MAX_PCT;
+  return discountCents / totalCents * 100 >= DISCOUNT_MAX_PCT;
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo


 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 44ms

   × discount threshold: % boundary — exactly 10% OK, 10%+1 cent over 20ms

[Killed] BlockStatement
app/lib/posRules.ts:41:101
 }
 
 // Split payment: remaining = total − Σ entered tenders (SRS method-rule "Split math").
-export function splitRemainingCents(totalCents: number, tenders: { amountCents: number }[]): number {
-  return totalCents - tenders.reduce((s, t) => s + t.amountCents, 0);
-}
+export function splitRemainingCents(totalCents: number, tenders: { amountCents: number }[]): number {}
 
 // BR-04: overpay is allowed on cash only (returned as change).
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 42ms

   × splitRemainingCents: exact, short, overpay 14ms

[Killed] ArithmeticOperator
app/lib/posRules.ts:42:48
 
 // Split payment: remaining = total − Σ entered tenders (SRS method-rule "Split math").
 export function splitRemainingCents(totalCents: number, tenders: { amountCents: number }[]): number {
-  return totalCents - tenders.reduce((s, t) => s + t.amountCents, 0);
+  return totalCents - tenders.reduce((s, t) => s - t.amountCents, 0);
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 44ms

   × splitRemainingCents: exact, short, overpay 17ms

[Killed] ArithmeticOperator
app/lib/posRules.ts:42:10
 
 // Split payment: remaining = total − Σ entered tenders (SRS method-rule "Split math").
 export function splitRemainingCents(totalCents: number, tenders: { amountCents: number }[]): number {
-  return totalCents - tenders.reduce((s, t) => s + t.amountCents, 0);
+  return totalCents + tenders.reduce((s, t) => s + t.amountCents, 0);
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 47ms

   × splitRemainingCents: exact, short, overpay 23ms

[Killed] BlockStatement
app/lib/posRules.ts:46:118
 }
 
 // BR-04: overpay is allowed on cash only (returned as change).
-export function splitOverpayAllowed(tenders: { method: string; amountCents: number }[], totalCents: number): boolean {
-  const sum = tenders.reduce((s, t) => s + t.amountCents, 0);
-  if (sum <= totalCents) return true;
-  return tenders.some((t) => t.method === "CASH");
-}
+export function splitOverpayAllowed(tenders: { method: string; amountCents: number }[], totalCents: number): boolean {}
 
 // Fresh-total basis for charge validation: the discount input may not have
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 41ms

   × splitOverpayAllowed: cash may overpay, card/QR may not (BR-04) 11ms

[Killed] ArithmeticOperator
app/lib/posRules.ts:47:40
 
 // BR-04: overpay is allowed on cash only (returned as change).
 export function splitOverpayAllowed(tenders: { method: string; amountCents: number }[], totalCents: number): boolean {
-  const sum = tenders.reduce((s, t) => s + t.amountCents, 0);
+  const sum = tenders.reduce((s, t) => s - t.amountCents, 0);
   if (sum <= totalCents) return true;
   return tenders.some((t) => t.method === "CASH");
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo


 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 49ms

   × splitOverpayAllowed: cash may overpay, card/QR may not (BR-04) 21ms

[Killed] ArrowFunction
app/lib/posRules.ts:47:30
 
 // BR-04: overpay is allowed on cash only (returned as change).
 export function splitOverpayAllowed(tenders: { method: string; amountCents: number }[], totalCents: number): boolean {
-  const sum = tenders.reduce((s, t) => s + t.amountCents, 0);
+  const sum = tenders.reduce(() => undefined, 0);
   if (sum <= totalCents) return true;
   return tenders.some((t) => t.method === "CASH");
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo


 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 54ms

   × splitOverpayAllowed: cash may overpay, card/QR may not (BR-04) 24ms

[Killed] ConditionalExpression
app/lib/posRules.ts:48:7
 // BR-04: overpay is allowed on cash only (returned as change).
 export function splitOverpayAllowed(tenders: { method: string; amountCents: number }[], totalCents: number): boolean {
   const sum = tenders.reduce((s, t) => s + t.amountCents, 0);
-  if (sum <= totalCents) return true;
+  if (false) return true;
   return tenders.some((t) => t.method === "CASH");
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 57ms

   × splitOverpayAllowed: cash may overpay, card/QR may not (BR-04) 23ms

[Killed] ConditionalExpression
app/lib/posRules.ts:48:7
 // BR-04: overpay is allowed on cash only (returned as change).
 export function splitOverpayAllowed(tenders: { method: string; amountCents: number }[], totalCents: number): boolean {
   const sum = tenders.reduce((s, t) => s + t.amountCents, 0);
-  if (sum <= totalCents) return true;
+  if (true) return true;
   return tenders.some((t) => t.method === "CASH");
 }
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 43ms

   × splitOverpayAllowed: cash may overpay, card/QR may not (BR-04) 18ms

[Killed] ConditionalExpression
app/lib/posRules.ts:49:30
 export function splitOverpayAllowed(tenders: { method: string; amountCents: number }[], totalCents: number): boolean {
   const sum = tenders.reduce((s, t) => s + t.amountCents, 0);
   if (sum <= totalCents) return true;
-  return tenders.some((t) => t.method === "CASH");
+  return tenders.some((t) => false);
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 70ms

   × splitOverpayAllowed: cash may overpay, card/QR may not (BR-04) 31ms

[Killed] EqualityOperator
app/lib/posRules.ts:49:30
 export function splitOverpayAllowed(tenders: { method: string; amountCents: number }[], totalCents: number): boolean {
   const sum = tenders.reduce((s, t) => s + t.amountCents, 0);
   if (sum <= totalCents) return true;
-  return tenders.some((t) => t.method === "CASH");
+  return tenders.some((t) => t.method !== "CASH");
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 59ms

   × splitOverpayAllowed: cash may overpay, card/QR may not (BR-04) 27ms

[Survived] BlockStatement
app/lib/posRules.ts:56:83
 // blurred yet, so the rendered total can be stale. The charge path commits the
 // pending discount first (cap − pendingDiscount) and validates against THAT
 // total — never the stale rendered one. Integer cents end-to-end.
-export function chargeTotalCents(capCents: number, discountCents: number): number {
-  return Math.max(0, capCents - discountCents);
-}
+export function chargeTotalCents(capCents: number, discountCents: number): number {}
 
 // Canonical split-tender validation — the same predicate the register uses for

[Survived] ArithmeticOperator
app/lib/posRules.ts:57:22
 // pending discount first (cap − pendingDiscount) and validates against THAT
 // total — never the stale rendered one. Integer cents end-to-end.
 export function chargeTotalCents(capCents: number, discountCents: number): number {
-  return Math.max(0, capCents - discountCents);
+  return Math.max(0, capCents + discountCents);
 }
 

[Survived] MethodExpression
app/lib/posRules.ts:57:10
 // pending discount first (cap − pendingDiscount) and validates against THAT
 // total — never the stale rendered one. Integer cents end-to-end.
 export function chargeTotalCents(capCents: number, discountCents: number): number {
-  return Math.max(0, capCents - discountCents);
+  return Math.min(0, capCents - discountCents);
 }
 

[Survived] BlockStatement
app/lib/posRules.ts:66:12
 export function isSplitTenderValid(
   tenders: { method: string; amountCents: number }[],
   totalCents: number,
-): boolean {
-  const remaining = splitRemainingCents(totalCents, tenders);
-  return (
-    tenders.length >= 2 &&
-    remaining <= 0 &&
-    (remaining === 0 || splitOverpayAllowed(tenders, totalCents))
-  );
-}
+): boolean {}
 
 export interface CashDecision {

[Survived] EqualityOperator
app/lib/posRules.ts:69:5
 ): boolean {
   const remaining = splitRemainingCents(totalCents, tenders);
   return (
-    tenders.length >= 2 &&
+    tenders.length > 2 &&
     remaining <= 0 &&
     (remaining === 0 || splitOverpayAllowed(tenders, totalCents))

[Survived] LogicalOperator
app/lib/posRules.ts:69:5
 ): boolean {
   const remaining = splitRemainingCents(totalCents, tenders);
   return (
-    tenders.length >= 2 &&
-    remaining <= 0 &&
-    (remaining === 0 || splitOverpayAllowed(tenders, totalCents))
+    tenders.length >= 2 && remaining <= 0 || remaining === 0 || splitOverpayAllowed(tenders, totalCents)
   );
 }

[Survived] EqualityOperator
app/lib/posRules.ts:70:5
   const remaining = splitRemainingCents(totalCents, tenders);
   return (
     tenders.length >= 2 &&
-    remaining <= 0 &&
+    remaining < 0 &&
     (remaining === 0 || splitOverpayAllowed(tenders, totalCents))
   );

[Survived] ConditionalExpression
app/lib/posRules.ts:70:5
   const remaining = splitRemainingCents(totalCents, tenders);
   return (
     tenders.length >= 2 &&
-    remaining <= 0 &&
+    true &&
     (remaining === 0 || splitOverpayAllowed(tenders, totalCents))
   );

[Survived] ConditionalExpression
app/lib/posRules.ts:71:6
   return (
     tenders.length >= 2 &&
     remaining <= 0 &&
-    (remaining === 0 || splitOverpayAllowed(tenders, totalCents))
+    (true)
   );
 }

[Survived] EqualityOperator
app/lib/posRules.ts:71:6
   return (
     tenders.length >= 2 &&
     remaining <= 0 &&
-    (remaining === 0 || splitOverpayAllowed(tenders, totalCents))
+    (remaining !== 0 || splitOverpayAllowed(tenders, totalCents))
   );
 }

[Survived] BlockStatement
app/lib/posRules.ts:84:88
 // Canonical cash-tender display/decision — the same predicate the register CASH
 // banner, confirm affordance, and doCharge() guard all key off: covered when
 // tenderedCents >= charge total; change/remaining derived from the same basis.
-export function cashDecision(tenderedCents: number, chargeTotal: number): CashDecision {
-  const covered = tenderedCents >= chargeTotal;
-  return {
-    covered,
-    changeCents: covered ? tenderedCents - chargeTotal : 0,
-    remainingCents: covered ? 0 : chargeTotal - tenderedCents,
-  };
-}
+export function cashDecision(tenderedCents: number, chargeTotal: number): CashDecision {}
 
 // Canonical confirm-button label for the CASH tab — mirrors the register copy

[Survived] ConditionalExpression
app/lib/posRules.ts:85:19
 // banner, confirm affordance, and doCharge() guard all key off: covered when
 // tenderedCents >= charge total; change/remaining derived from the same basis.
 export function cashDecision(tenderedCents: number, chargeTotal: number): CashDecision {
-  const covered = tenderedCents >= chargeTotal;
+  const covered = true;
   return {
     covered,

[Survived] EqualityOperator
app/lib/posRules.ts:85:19
 // banner, confirm affordance, and doCharge() guard all key off: covered when
 // tenderedCents >= charge total; change/remaining derived from the same basis.
 export function cashDecision(tenderedCents: number, chargeTotal: number): CashDecision {
-  const covered = tenderedCents >= chargeTotal;
+  const covered = tenderedCents < chargeTotal;
   return {
     covered,

[Survived] ObjectLiteral
app/lib/posRules.ts:86:10
 // tenderedCents >= charge total; change/remaining derived from the same basis.
 export function cashDecision(tenderedCents: number, chargeTotal: number): CashDecision {
   const covered = tenderedCents >= chargeTotal;
-  return {
-    covered,
-    changeCents: covered ? tenderedCents - chargeTotal : 0,
-    remainingCents: covered ? 0 : chargeTotal - tenderedCents,
-  };
+  return {};
 }
 
