[Survived] ArithmeticOperator
app/lib/posRules.ts:88:28
   const covered = tenderedCents >= chargeTotal;
   return {
     covered,
-    changeCents: covered ? tenderedCents - chargeTotal : 0,
+    changeCents: covered ? tenderedCents + chargeTotal : 0,
     remainingCents: covered ? 0 : chargeTotal - tenderedCents,
   };

[Survived] ArithmeticOperator
app/lib/posRules.ts:89:35
   return {
     covered,
     changeCents: covered ? tenderedCents - chargeTotal : 0,
-    remainingCents: covered ? 0 : chargeTotal - tenderedCents,
+    remainingCents: covered ? 0 : chargeTotal + tenderedCents,
   };
 }

[Survived] BlockStatement
app/lib/posRules.ts:95:86
 
 // Canonical confirm-button label for the CASH tab — mirrors the register copy
 // exactly ("Enter amount" while short, "Confirm <formatted total>" when covered).
-export function cashConfirmLabel(tenderedCents: number, chargeTotal: number): string {
-  return tenderedCents < chargeTotal ? "Enter amount" : `Confirm ${formatCents(chargeTotal)}`;
-}
+export function cashConfirmLabel(tenderedCents: number, chargeTotal: number): string {}
 
 // Expected drawer at close: float + cash received − cash given back as change, for paid orders.

[Survived] ConditionalExpression
app/lib/posRules.ts:96:10
 // Canonical confirm-button label for the CASH tab — mirrors the register copy
 // exactly ("Enter amount" while short, "Confirm <formatted total>" when covered).
 export function cashConfirmLabel(tenderedCents: number, chargeTotal: number): string {
-  return tenderedCents < chargeTotal ? "Enter amount" : `Confirm ${formatCents(chargeTotal)}`;
+  return false ? "Enter amount" : `Confirm ${formatCents(chargeTotal)}`;
 }
 

[Survived] EqualityOperator
app/lib/posRules.ts:96:10
 // Canonical confirm-button label for the CASH tab — mirrors the register copy
 // exactly ("Enter amount" while short, "Confirm <formatted total>" when covered).
 export function cashConfirmLabel(tenderedCents: number, chargeTotal: number): string {
-  return tenderedCents < chargeTotal ? "Enter amount" : `Confirm ${formatCents(chargeTotal)}`;
+  return tenderedCents >= chargeTotal ? "Enter amount" : `Confirm ${formatCents(chargeTotal)}`;
 }
 

[Killed] BlockStatement
app/lib/posRules.ts:100:82
 }
 
 // Expected drawer at close: float + cash received − cash given back as change, for paid orders.
-export function expectedCashCents(openingFloat: number, orders: Order[]): number {
-  return orders
-    .filter((o) => o.status === "PAID")
-    .reduce(
-      (drawer, o) =>
-        drawer +
-        o.payments.filter((p) => p.method === "CASH").reduce((s, p) => s + p.amountCents, 0) -
-        (o.changeCents ?? 0),
-      openingFloat,
-    );
-}
+export function expectedCashCents(openingFloat: number, orders: Order[]): number {}
 
 export function varianceCents(expected: number, counted: number): number {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo


 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 39ms

   × expectedCashCents: float + cash received − cash change, ignores non-cash/unpaid 13ms

[Killed] MethodExpression
app/lib/posRules.ts:101:10
 
 // Expected drawer at close: float + cash received − cash given back as change, for paid orders.
 export function expectedCashCents(openingFloat: number, orders: Order[]): number {
-  return orders
-    .filter((o) => o.status === "PAID")
+  return orders
     .reduce(
       (drawer, o) =>
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo


 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 43ms

   × expectedCashCents: float + cash received − cash change, ignores non-cash/unpaid 19ms

[Killed] ArrowFunction
app/lib/posRules.ts:102:13
 // Expected drawer at close: float + cash received − cash given back as change, for paid orders.
 export function expectedCashCents(openingFloat: number, orders: Order[]): number {
   return orders
-    .filter((o) => o.status === "PAID")
+    .filter(() => undefined)
     .reduce(
       (drawer, o) =>
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 49ms

   × expectedCashCents: float + cash received − cash change, ignores non-cash/unpaid 25ms

[Killed] ConditionalExpression
app/lib/posRules.ts:102:20
 // Expected drawer at close: float + cash received − cash given back as change, for paid orders.
 export function expectedCashCents(openingFloat: number, orders: Order[]): number {
   return orders
-    .filter((o) => o.status === "PAID")
+    .filter((o) => false)
     .reduce(
       (drawer, o) =>
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo


 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 45ms

   × expectedCashCents: float + cash received − cash change, ignores non-cash/unpaid 21ms

[Killed] ArrowFunction
app/lib/posRules.ts:104:7
   return orders
     .filter((o) => o.status === "PAID")
     .reduce(
-      (drawer, o) =>
-        drawer +
-        o.payments.filter((p) => p.method === "CASH").reduce((s, p) => s + p.amountCents, 0) -
-        (o.changeCents ?? 0),
+      () => undefined,
       openingFloat,
     );
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 47ms

   × expectedCashCents: float + cash received − cash change, ignores non-cash/unpaid 17ms

[Killed] ArithmeticOperator
app/lib/posRules.ts:105:9
     .filter((o) => o.status === "PAID")
     .reduce(
       (drawer, o) =>
-        drawer +
-        o.payments.filter((p) => p.method === "CASH").reduce((s, p) => s + p.amountCents, 0) -
-        (o.changeCents ?? 0),
+        drawer + o.payments.filter(p => p.method === "CASH").reduce((s, p) => s + p.amountCents, 0) + (o.changeCents ?? 0),
       openingFloat,
     );
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 46ms

   × expectedCashCents: float + cash received − cash change, ignores non-cash/unpaid 22ms

[Killed] ArithmeticOperator
app/lib/posRules.ts:105:9
     .filter((o) => o.status === "PAID")
     .reduce(
       (drawer, o) =>
-        drawer +
-        o.payments.filter((p) => p.method === "CASH").reduce((s, p) => s + p.amountCents, 0) -
+        drawer - o.payments.filter(p => p.method === "CASH").reduce((s, p) => s + p.amountCents, 0) -
         (o.changeCents ?? 0),
       openingFloat,
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 64ms

   × expectedCashCents: float + cash received − cash change, ignores non-cash/unpaid 32ms

[Killed] ArrowFunction
app/lib/posRules.ts:106:27
     .reduce(
       (drawer, o) =>
         drawer +
-        o.payments.filter((p) => p.method === "CASH").reduce((s, p) => s + p.amountCents, 0) -
+        o.payments.filter(() => undefined).reduce((s, p) => s + p.amountCents, 0) -
         (o.changeCents ?? 0),
       openingFloat,
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 91ms

   × expectedCashCents: float + cash received − cash change, ignores non-cash/unpaid 51ms

[Killed] ConditionalExpression
app/lib/posRules.ts:106:34
     .reduce(
       (drawer, o) =>
         drawer +
-        o.payments.filter((p) => p.method === "CASH").reduce((s, p) => s + p.amountCents, 0) -
+        o.payments.filter((p) => false).reduce((s, p) => s + p.amountCents, 0) -
         (o.changeCents ?? 0),
       openingFloat,
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 44ms

   × expectedCashCents: float + cash received − cash change, ignores non-cash/unpaid 21ms

[Killed] LogicalOperator
app/lib/posRules.ts:107:10
       (drawer, o) =>
         drawer +
         o.payments.filter((p) => p.method === "CASH").reduce((s, p) => s + p.amountCents, 0) -
-        (o.changeCents ?? 0),
+        (o.changeCents && 0),
       openingFloat,
     );
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo


 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 47ms

   × expectedCashCents: float + cash received − cash change, ignores non-cash/unpaid 21ms

[Killed] BlockStatement
app/lib/posRules.ts:112:74
     );
 }
 
-export function varianceCents(expected: number, counted: number): number {
-  return counted - expected;
-}
+export function varianceCents(expected: number, counted: number): number {}
 
 // Receipt-delivery target validation (FR-31) — lenient format checks, server re-validates.
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 40ms

   × varianceCents sign: counted − expected 17ms

[Killed] ArithmeticOperator
app/lib/posRules.ts:113:10
 }
 
 export function varianceCents(expected: number, counted: number): number {
-  return counted - expected;
+  return counted + expected;
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 51ms

   × varianceCents sign: counted − expected 21ms

[Killed] BlockStatement
app/lib/posRules.ts:117:48
 }
 
 // Receipt-delivery target validation (FR-31) — lenient format checks, server re-validates.
-export function validEmail(s: string): boolean {
-  return /^\S+@\S+\.\S+$/.test(s.trim());
-}
+export function validEmail(s: string): boolean {}
 
 export function validPhone(s: string): boolean {
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 40ms

   × validEmail: accepts real, rejects junk 13ms

[Killed] MethodExpression
app/lib/posRules.ts:118:32
 
 // Receipt-delivery target validation (FR-31) — lenient format checks, server re-validates.
 export function validEmail(s: string): boolean {
-  return /^\S+@\S+\.\S+$/.test(s.trim());
+  return /^\S+@\S+\.\S+$/.test(s);
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 63ms

   × validEmail: accepts real, rejects junk 28ms

[Killed] Regex
app/lib/posRules.ts:118:10
 
 // Receipt-delivery target validation (FR-31) — lenient format checks, server re-validates.
 export function validEmail(s: string): boolean {
-  return /^\S+@\S+\.\S+$/.test(s.trim());
+  return /^\s+@\S+\.\S+$/.test(s.trim());
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 42ms

   × validEmail: accepts real, rejects junk 19ms

[Killed] BlockStatement
app/lib/posRules.ts:121:48
   return /^\S+@\S+\.\S+$/.test(s.trim());
 }
 
-export function validPhone(s: string): boolean {
-  return s.replace(/\D/g, "").length >= 7;
-}
+export function validPhone(s: string): boolean {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 48ms

   × validPhone: ≥7 digits, separators allowed 18ms

[Killed] ConditionalExpression
app/lib/posRules.ts:122:10
 }
 
 export function validPhone(s: string): boolean {
-  return s.replace(/\D/g, "").length >= 7;
+  return false;
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo


 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 65ms

   × validPhone: ≥7 digits, separators allowed 30ms

[Killed] ConditionalExpression
app/lib/posRules.ts:122:10
 }
 
 export function validPhone(s: string): boolean {
-  return s.replace(/\D/g, "").length >= 7;
+  return true;
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 C:/Users/zenja/OneDrive/Desktop/RANDOM CODE/WEB APPLICATION/POS System/POS-APP/.stryker-tmp/sandbox-6GdRJo



 ❯ tests/unit/posRules.test.ts (13 tests | 1 failed) 61ms

   × validPhone: ≥7 digits, separators allowed 29ms
